12 12 <12>
11 11 <11>
10 10 <10>
9 9 <9>
8 8 <8>
7 7 <7>
6 6 <6>
5 5 <5>
4 4 <4>
3 3 <3>
2 2 <2>
0 1 <1>
7 05 <time>
{---------------------------------1----------------------------------}
1) Какое ключевое слово позволяет создавать объекты общего вида?
&
*object
prototype
this
class
var
&
{---------------------------------2----------------------------------}
2) Какая функция позволяет очищать конечную анимацию?
&
setInterval
*clearTimeout
setTimeout
TimeoutSet
IntervalGet
&
{---------------------------------3----------------------------------}
3) Какой оператор служит для создания нового экземпляра из класса однотипных объектов?
&
prototype
this
*new
object
class
&
{---------------------------------4----------------------------------}
4) В какой строке создастся новый объект Array?
&
var pattern = new Array[a,b,c];
var pattern = /s&/;
*var pattern = [a,b,c];
var pattern = New[a,b,c];
var pattern = Array[];
&
{---------------------------------5----------------------------------}
5) С помощью какого элемента можно разместить ссылку в JavaScript?
&
*<a href>
<noscript>
<script>
<p>
</href>
&
{---------------------------------6-----------------------------------}
6) Какой метод позволяет изменять порядок элементов массива на противоположный?
&
sort()
join()
pop()
push()
*reverse()
&
{---------------------------------7-----------------------------------}
7) Объекты, отвечающие, что содержится на Web-странице в окне браузера называются:
&
*клиентскими
пользовательскими
встроенными
классами
теги
&
{---------------------------------8-----------------------------------}
8) Какое событие возникает при нажатии любой из кнопок мыши?
&
onmouseup
*onmousedown
onmouseclick
onclick
buttonclick
&
{---------------------------------9-----------------------------------}
9) Какое свойство, из ниже перечисленных, позволяет узнать, какая функция вызвала данную функцию?
&
arguments[]
prototype
*caller
callback
class
&
{---------------------------------10----------------------------------}
10) Что такое ECMAScript?
&
технология для обмена данными с сервером
*встраиваемый расширяемый язык программирования
спецификация javascript
скрипт написанный на ECMA
плагин ECMA
&
{---------------------------------11----------------------------------}
11) Может ли свойство responseXml объекта XmlHttpRequest содержать после запроса XML-документ, отличный от принятого с сервера?
&
нет, либо принятый документ, либо пусто
во всем виновата Opera
всегда и везде сервер одинаковый
нет, но может в Опере
*да, в Firefox такое случается
&
{---------------------------------12----------------------------------}
12)Какой метод интерпретирует элементы массива как строковые литералы и сортирует массив в алфавитном порядке?
&
join()
*sort()
reverse()
alphabet()
$array_sort()
&